fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьСпециалиста</name>
    <type>
      <types>Planner</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКалендаря</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СохрПер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьКалендарь();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ОбслуживаниеКлиента" Тогда
		ОбновитьКалендарь();
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КалендарьСпециалистаПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеЗаполнения = Новый Структура;
	ЗначениеЗаполнения.Вставить("Дата", ОбщегоНазначенияКлиент.ДатаСеанса());
	ЗначениеЗаполнения.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначениеЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначениеЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначениеЗаполнения.Вставить("Специалист", Объект.Специалист);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначениеЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистаПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистаПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПериодКалендаря.ДатаНачала) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните период перед обновлением календаря";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Специалист) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните поле Специалист перед обновлением календаря";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;

	ОбновитьКалендарь();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьКалендарь()
	
	Объект.КалендарьСпециалиста.Элементы.Очистить();
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Очистить();
	
	НачалоПериода = Объект.ПериодКалендаря.ДатаНачала;
	КонецПериода = Объект.ПериодКалендаря.ДатаОкончания;

	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Специалист) Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата >= &ДатаНачала
		|	И ВКМ_ОбслуживаниеКлиента.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если Объект.Специалист = ВыборкаДетальныеЗаписи.Специалист Тогда
			ДатаНачалоДня = НачалоДня(ВыборкаДетальныеЗаписи.Дата) + Час(ВыборкаДетальныеЗаписи.ВремяНачалаРабот)* 60 
					* 60 + Минута(ВыборкаДетальныеЗаписи.ВремяНачалаРабот) * 60;
			КонецДня = (КонецДня(ВыборкаДетальныеЗаписи.Дата) + Час(ВыборкаДетальныеЗаписи.ВремяОкончанияРабот) * 60 
					* 60 + Минута(ВыборкаДетальныеЗаписи.ВремяНачалаРабот) * 60) - 86399;
			ЭлементКалендаря = Объект.КалендарьСпециалиста.Элементы.Добавить(ДатаНачалоДня, КонецДня);
			ЭлементКалендаря.Значение = ВыборкаДетальныеЗаписи.Ссылка;
			ЭлементКалендаря.Текст = СтрШаблон("Специалист: %1, Дата: %2", ВыборкаДетальныеЗаписи.Специалист,
				Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy"));	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти
